; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	satellite1 - satellite
	instrument1 - instrument
	instrument2 - instrument
	instrument3 - instrument
	infrared0 - mode
	infrared1 - mode
	GroundStation1 - direction
	Star4 - direction
	GroundStation0 - direction
	GroundStation3 - direction
	Star2 - direction
	Star5 - direction
	Phenomenon6 - direction
	Star7 - direction
	Star8 - direction
	Star9 - direction
	Planet10 - direction
	Planet11 - direction
	Planet12 - direction
	Phenomenon13 - direction
	Planet14 - direction
)
(:init
	(supports instrument0 infrared0)
	(calibration_target instrument0 GroundStation0)
	(on_board instrument0 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Planet12)
	(supports instrument1 infrared0)
	(calibration_target instrument1 Star2)
	(supports instrument2 infrared0)
	(supports instrument2 infrared1)
	(calibration_target instrument2 GroundStation3)
	(supports instrument3 infrared1)
	(supports instrument3 infrared0)
	(calibration_target instrument3 Star5)
	(calibration_target instrument3 Star2)
	(on_board instrument1 satellite1)
	(on_board instrument2 satellite1)
	(on_board instrument3 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Planet10)
)
(:goal (and
	(have_image Phenomenon6 infrared0)
	(have_image Star7 infrared1)
	(have_image Star8 infrared0)
	(have_image Star9 infrared0)
	(have_image Planet10 infrared0)
	(have_image Planet11 infrared0)
	(have_image Planet12 infrared0)
	(have_image Phenomenon13 infrared1)
	(have_image Planet14 infrared0)
))

)

; plan
1. (turn_to satellite1 groundstation3 planet10)
   deleted: (pointing satellite1 planet10)
   added: (pointing satellite1 groundstation3)
   goals met: 0 of 9
2. (switch_on instrument2 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument2)
   goals met: 0 of 9
3. (calibrate satellite1 instrument2 groundstation3)
   added: (calibrated instrument2)
   goals met: 0 of 9
4. (turn_to satellite1 planet10 groundstation3)
   deleted: (pointing satellite1 groundstation3)
   added: (pointing satellite1 planet10)
   goals met: 0 of 9
5. (take_image satellite1 planet10 instrument2 infrared0)
   added: (have_image planet10 infrared0)
   goals met: 1 of 9
6. (turn_to satellite1 phenomenon6 planet10)
   deleted: (pointing satellite1 planet10)
   added: (pointing satellite1 phenomenon6)
   goals met: 1 of 9
7. (take_image satellite1 phenomenon6 instrument2 infrared0)
   added: (have_image phenomenon6 infrared0)
   goals met: 2 of 9
8. (turn_to satellite1 phenomenon13 phenomenon6)
   deleted: (pointing satellite1 phenomenon6)
   added: (pointing satellite1 phenomenon13)
   goals met: 2 of 9
9. (take_image satellite1 phenomenon13 instrument2 infrared1)
   added: (have_image phenomenon13 infrared1)
   goals met: 3 of 9
10. (turn_to satellite1 planet11 phenomenon13)
   deleted: (pointing satellite1 phenomenon13)
   added: (pointing satellite1 planet11)
   goals met: 3 of 9
11. (take_image satellite1 planet11 instrument2 infrared0)
   added: (have_image planet11 infrared0)
   goals met: 4 of 9
12. (turn_to satellite1 planet12 planet11)
   deleted: (pointing satellite1 planet11)
   added: (pointing satellite1 planet12)
   goals met: 4 of 9
13. (take_image satellite1 planet12 instrument2 infrared0)
   added: (have_image planet12 infrared0)
   goals met: 5 of 9
14. (turn_to satellite1 planet14 planet12)
   deleted: (pointing satellite1 planet12)
   added: (pointing satellite1 planet14)
   goals met: 5 of 9
15. (take_image satellite1 planet14 instrument2 infrared0)
   added: (have_image planet14 infrared0)
   goals met: 6 of 9
16. (turn_to satellite1 star7 planet14)
   deleted: (pointing satellite1 planet14)
   added: (pointing satellite1 star7)
   goals met: 6 of 9
17. (take_image satellite1 star7 instrument2 infrared1)
   added: (have_image star7 infrared1)
   goals met: 7 of 9
18. (turn_to satellite1 star8 star7)
   deleted: (pointing satellite1 star7)
   added: (pointing satellite1 star8)
   goals met: 7 of 9
19. (take_image satellite1 star8 instrument2 infrared0)
   added: (have_image star8 infrared0)
   goals met: 8 of 9
20. (turn_to satellite1 star9 star8)
   deleted: (pointing satellite1 star8)
   added: (pointing satellite1 star9)
   goals met: 8 of 9
21. (take_image satellite1 star9 instrument2 infrared0)
   added: (have_image star9 infrared0)
   goals met: 9 of 9
